Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can send your logs to Logstash using a TCP input in the https://www.elastic.co/guide/en/ecs-logging/overview/current/intro.html[ECS] format. To achieve this, we will use the `quarkus-logging-json` extension to format the logs in JSON format and the socket handler to send them to Logstash.
ja_jp: https://www.elastic.co/guide/en/ecs-logging/overview/current/intro.html[ECS] フォーマットの TCP 入力を使用して、ログを Logstash に送信できます。 これを実現するには、 `quarkus-logging-json` エクステンションを使用してログを JSON でフォーマットし、ソケットハンドラーを使用してログを Logstash に送信します。

source: You can set a `Locale` instance or a locale tag string (IETF).
ja_jp: `Locale` インスタンスかロケールタグ文字列 (IETF) をセットすることが出来ます。

source: You can set a https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#built-in-samplers[built-in sampler] simply by setting the desired sampler config described in the <<configuration-reference>>.
ja_jp: link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#built-in-samplers[内蔵サンプラー]の設定は、 link:#configuration-reference[[configuration-reference]]に記載されている希望のサンプラー設定を設定するだけで可能です。

source: You can set a https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#built-in-samplers[built-in sampler] simply by setting the desired sampler config described in the xref:configuration-reference[OpenTelemetry Configuration Reference].
ja_jp: OpenTelemet xref:configuration-reference[ry Configuration Reference] に記載されている目的のサンプラー設定を設定するだけで、 link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#built-in-samplers[内蔵サンプラー] を設定することができます。

source: You can set the `TRACE` level for the category `io.quarkus.arc.processor` and try to analyze the log output afterwards.
ja_jp: `io.quarkus.arc.processor` のカテゴリーに `TRACE` レベルを設定し、その後、ログ出力の解析を試みてください。

source: You can set the `TRACE` level for the logger `io.quarkus.arc.requestContext` and try to analyze the log output afterwards.
ja_jp: ロガー `io.quarkus.arc.requestContext` の `TRACE` レベルを設定し、後でログ出力の分析を試みることができます。

source: You can set the `redirect_uri` value to `*` only for test purposes, especially when the containers are shared between multiple applications.
ja_jp: 特にコンテナーが複数のアプリケーション間で共有されている場合は、テスト目的でのみ `redirect_uri` 値を `*` に設定できます。

source: You can set the `redirect_uri` value to `*` only for the test purposes, especially when the containers are shared between multiple applications.
ja_jp: 特にコンテナーが複数のアプリケーション間で共有されている場合は、テスト目的でのみ `redirect_uri` 値を `*` に設定できます。

source: You can set the attributes of the `Response` (the status comes to mind in the case of an error).
ja_jp: `Response` の属性を設定できます (エラーが発生したときにステータスを知ることができます)。

source: You can set the configuration properties for a test with the `@io.quarkus.test.component.TestConfigProperty` annotation or with the `QuarkusComponentTestExtensionBuilder#configProperty(String, String)` method. If you only need to use the default values for missing config properties, then the `@QuarkusComponentTest#useDefaultConfigProperties()` or `QuarkusComponentTestExtensionBuilder#useDefaultConfigProperties()` might come in useful.
ja_jp: `@io.quarkus.test.component.TestConfigProperty` アノテーションまたは `QuarkusComponentTestExtensionBuilder#configProperty(String, String)` メソッドを使用して、テストの設定プロパティーを設定できます。 不足している設定プロパティーに対してデフォルト値を使用する必要があるだけの場合は、 `@QuarkusComponentTest#useDefaultConfigProperties()` または `QuarkusComponentTestExtensionBuilder#useDefaultConfigProperties()` が役立つ場合があります。

source: You can set the root path for all rest endpoints using the `@ApplicationPath` annotation, as shown below.
ja_jp: 以下に示すように、 `@ApplicationPath` アノテーションを使用して、すべての REST エンドポイントのルートパスを設定できます。

source: You can set thresholds for code coverage using the JaCoCo Maven plugin. Note the element `<dataFile>${project.build.directory}/jacoco-quarkus.exec</dataFile>`. You must set it matching your choice for `quarkus.jacoco.data-file`.
ja_jp: JaCoCo Maven プラグインを使用して、コードカバレッジの閾値を設定することができます。注意点としては、 `<dataFile>${project.build.directory}/jacoco-quarkus.exec</dataFile>` があり、 `quarkus.jacoco.data-file` の設定と一致するように設定が必要です。

source: You can set thresholds for code coverage using the Jacoco Maven plugin. Note the element `<dataFile>${project.build.directory}/jacoco-quarkus.exec</dataFile>`. You must set it matching your choice for `quarkus.jacoco.data-file`.
ja_jp: コードカバレッジのしきい値は、Jacoco Mavenプラグインを使って設定することができます。 `<dataFile>${project.build.directory}/jacoco-quarkus.exec</dataFile>` という要素に注意してください。 `quarkus.jacoco.data-file` の選択に合わせて設定する必要があります。

source: You can set up policy enforcer configurations for each tenant, similar to how it is done with xref:security-openid-connect-multitenancy.adoc[OpenID Connect (OIDC) multi-tenancy]. For example:
ja_jp: xref:security-openid-connect-multitenancy.adoc[OpenID Connect (OIDC) マルチテナンシー] と同様に、テナントごとにポリシーエンフォーサー設定をセットアップできます。 以下に例を示します。

source: You can sign the claims and then encrypt the nested JWT token by combining the sign and encrypt steps.
ja_jp: クレームに署名し、署名と暗号化のステップを組み合わせてネストされた JWT トークンを暗号化できます。

source: You can sign the claims immediately or after configuring the `JSON Web Signature (JWS)` headers:
ja_jp: クレームは、すぐに署名することも、 `JSON Web Signature (JWS)` ヘッダーを設定した後に署名することもできます。

source: You can skip gRPC code generation using:
ja_jp: 次を使用して gRPC コード生成をスキップできます。

source: You can specify `@CheckedTemplate#ignoreFragments=true` in order to disable this feature, i.e. a dollar sign `$` in the method name will not result in a checked fragment method.
ja_jp: この機能を無効にするために、 `@CheckedTemplate#ignoreFragments=true` を指定することができます。つまり、メソッド名にドル記号 `$` を指定しても、チェックされたフラグメントメソッドになることはありません。

source: You can specify `{#include item$item_aliases _ignoreFragments=true /}` in order to disable this feature, i.e. a dollar sign `$` in the template identifier does not result in a fragment lookup.
ja_jp: この機能を無効にするために、`{#include item$item_aliases _ignoreFragments=true /}` を指定できます。つまり、テンプレート識別子にドル記号 `$` を指定しても、フラグメント検索は行われません。

source: You can specify a custom implementation of the `java.security.Permission` class. Your custom class must define exactly one constructor that accepts the permission name and optionally some actions, for example, `String` array. In this scenario, the permission `list` is added to the `SecurityIdentity` instance as `new CustomPermission("list")`.
ja_jp: `java.security.Permission` クラスのカスタム実装を指定できます。 カスタムクラスでは、権限名と、オプションでいくつかのアクション (たとえば、 `String` 配列) を受け入れるコンストラクターを 1 つだけ定義する必要があります。 このシナリオでは、権限 `list` が `new CustomPermission ("list")` として `SecurityIdentity` インスタンスに追加されます。

source: You can specify a named query to filter when listing the entities. For example, having the following named query in your entity:
ja_jp: エンティティのリストアップ時にフィルタリングする名前付きクエリを指定することができます。例えば、エンティティに次のような名前付きクエリを持つことです:

source: You can specify custom files to use by setting the `quarkus.compose.devservices.files` property in the `application.properties` file:
ja_jp: `application.properties` ファイルで `quarkus.compose.devservices.files` プロパティーを設定することで、使用するカスタムファイルを指定できます:

source: You can specify the `groupId`, `artifactId` and `version` using the `group:artifactId:version` coordinates syntax directly from the command line. You can selectively omit segments to use the default values:
ja_jp: コマンドラインから直接、 `groupId` 、 `artifactId` 、 `version` を `group:artifactId:version` の構文を使用して指定することができます。セグメントを選択的に省略して、デフォルト値を使用することができます:

source: You can specify your own ID strategy by extending `PanacheEntityBase` instead of `PanacheEntity`. Then you just declare whatever ID you want as a public field:
ja_jp: `PanacheEntity` の代わりに `PanacheEntityBase` を拡張することで独自のID戦略を指定することができます。そのあとに好きなIDをパブリック・フィールドとして宣言するだけです:

source: You can specify your own ID strategy by extending `PanacheMongoEntityBase` instead of `PanacheMongoEntity`. Then you just declare whatever ID you want as a public field by annotating it by `@BsonId`:
ja_jp: `PanacheMongoEntity` の代わりに `PanacheMongoEntityBase` を拡張することで、独自のID戦略を指定することができます。そして、 `@BsonId` でアノテーションを付けて、好きなIDをパブリック・フィールドとして宣言します。

source: You can start dev mode using a custom profile:
ja_jp: カスタムプロファイルを使用して開発モードを開始することができます:

source: You can start the application in dev mode as follows:
ja_jp: 開発モードでアプリケーションを起動するには、次のようにします:

source: You can start the hot reload using:
ja_jp: 次を使ってホットリロードを開始することができます:

source: You can start with java and add kotlin later in another PR (create an issue so you don't forget).
ja_jp: javaから始めて、後で別のPRでkotlinを追加することもできます（忘れないようにissueを作成してください）。

source: You can still access `SecurityIdentity` synchronously with `public SecurityIdentity getIdentity()` in xref:rest.adoc[Quarkus REST (formerly RESTEasy Reactive)] from endpoints that are annotated with `@RolesAllowed`, `@Authenticated`, or with respective configuration authorization checks because authentication has already happened. The same is also valid for xref:reactive-routes.adoc[Reactive routes] if a route response is synchronous.
ja_jp: 認証がすでに行われているため、`@RolesAllowed`、`@Authenticated`、またはそれぞれの設定認可チェックでアノテーションが付けられたエンドポイントから、xref:rest.adoc[Quarkus REST (formerly RESTEasy Reactive)] の `public SecurityIdentity getIdentity()` を使用して `SecurityIdentity` に同期的にアクセスできます。 ルート応答が同期的である場合、xref:reactive-routes.adoc[Reactive ルート] にも同じことが当てはまります。

source: You can still use Maven 3.6 if you are so inclined.
ja_jp: 必要であれば、Maven 3.6を使うこともできます。

source: You can store counters in Redis as demonstrated below:
ja_jp: 以下に示すように、Redis にカウンターを格納することができます。

source: You can style the swagger ui by supplying your own logo and css.
ja_jp: 独自のロゴやCSSを供給することで、swagger uiをスタイリングすることができます。

source: You can supply a protobuf schema through either one of two ways.
ja_jp: 2つの方法のいずれかでprotobufスキーマを提供できます。

source: You can test the application demonstrated in this example with a web browser or a terminal by using `curl` and the complete URL output from `oc get routes`, that is, "\http://openshift-helloworld-username-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com".
ja_jp: `curl` と、 `oc get routes` から出力された完全なURL、つまり "http://openshift-helloworld-username-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com "を使って、ウェブブラウザやターミナルでこの例で示したアプリケーションをテストすることができます。

source: You can test the application demonstrated in this example with a web browser or a terminal by using `curl` and the complete URL output from `oc get routes`, that is, `\http://openshift-helloworld-username-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com`.
ja_jp: この例で示されているアプリケーションは、`curl` と、 `oc get routes` から出力される完全な URL (つまり `\http://openshift-helloworld-username-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com`) を使って、Web ブラウザーまたはターミナルでテストできます。

source: You can test the application launched in JVM or Native modes with `curl`.
ja_jp: `curl` を使用して、JVM またはネイティブモードで起動したアプリケーションをテストできます。

source: You can test the application launched in JVM or native modes with `curl`.
ja_jp: `curl` を使用して、JVM またはネイティブモードで起動したアプリケーションをテストできます。

source: You can test the application running in JVM or native modes by using `curl`.
ja_jp: `curl` を使用して、JVM またはネイティブモードで実行されているアプリケーションをテストできます。

source: You can test the service the same way as with the `Password` grant.
ja_jp: `Password` グラントと同じ方法でサービスをテストできます。

source: You can test your application even when it is compiled into a native executable, while the database will run as a JVM process.
ja_jp: データベースが JVM プロセスとして実行されている間、アプリケーションをネイティブ実行可能ファイルにコンパイルしてもテストを実行できます。

source: You can the use the `io.quarkus.test.common.http.TestHTTPEndpoint` annotation to specify the endpoint path, and the path will be extracted from the provided endpoint. If you also specify a value for the `TestHTTPResource` endpoint it will be appended to the end of the endpoint path.
ja_jp: `io.quarkus.test.common.http.TestHTTPEndpoint` アノテーションを使用してエンドポイントのパスを指定することが出来、 指定されたエンドポイントからパスが抽出されます。 `TestHTTPResource` エンドポイントにも値を指定すると、 エンドポイントパスの最後に追加されます。

source: You can then access these beans via injection:
ja_jp: その後、注入によってこれらのBeanにアクセスすることができます:

source: You can then build a native executable with the usual command:
ja_jp: その後、通常のコマンドでネイティブ実行可能ファイルをビルドすることができます。

source: You can then call your endpoints via:
ja_jp: そして、エンドポイントを経由して呼び出すことができます:

source: You can then deploy the application to OpenShift Serverless by enabling the standard `quarkus.kubernetes.deploy=true` property.
ja_jp: その後、標準の `quarkus.kubernetes.deploy=true` プロパティを有効にすることで、アプリケーションを OpenShift Serverless にデプロイできます。

source: You can then execute the application by using the standard `java -jar your-application.jar` command.
ja_jp: その後、標準の `java -jar your-application.jar` コマンドを使用してアプリケーションを実行できます。

source: You can then happily inject your `EntityManager`:
ja_jp: その後、 `EntityManager` をうまく注入することができます。

source: You can then happily inject your `Mutiny.SessionFactory`:
ja_jp: その後、 `Mutiny.SessionFactory` を注入することができます。

source: You can then head over to `Preferences | Editor | Inspections | Qute | Templates | Validation`,
ja_jp: その後、 `Preferences | Editor | Inspections | Qute | Templates | Validation` 、

source: You can then inject the clients as follows:
ja_jp: 次に、次のようにクライアントを挿入できます。

source: You can then point your browser to `http://localhost:8080/` and use your application.
ja_jp: その後、ブラウザで `http://localhost:8080/` を開きアプリケーションを使用します。

source: You can then point your browser to `http://localhost:8080/fruits.html` and use your application.
ja_jp: その後、ブラウザで `http://localhost:8080/fruits.html` を開いてアプリケーションを使用します。

source: You can then test the executable locally with sam local
ja_jp: その後、ローカルで sam local を使って実行ファイルをテストすることができます。

source: You can then update the application sources, resources and configurations. The changes are automatically reflected in your running application. This is great to do development spanning UI and database as you see changes reflected immediately.
ja_jp: その後、アプリケーションのソース、リソース、および設定を更新することができます。変更は実行中のアプリケーションに自動的に反映されます。変更がすぐに反映されるので、UIやデータベースにまたがった開発をするのに最適です。

source: You can then update those exclusions in `Preferences | Editor | Inspections | MicroProfile | Java files | Unassigned properties` or `Preferences | Editor | Inspections | MicroProfile | Properties files | Unassigned properties`
ja_jp: その後、 `Preferences | Editor | Inspections | MicroProfile | Java files | Unassigned properties` または `Preferences | Editor | Inspections | MicroProfile | Properties files | Unassigned properties`

source: You can then use the Log4j API inside your application.
ja_jp: これで、アプリケーション内でLog4J APIを使用することができます。

source: You can then write tests to verify that your emails were sent, for example, by a REST endpoint:
ja_jp: そして、例えばRESTエンドポイントでメールが送信されたことを検証するテストを書くことができます:

source: You can trigger a build and deployment in a single step or build the container image first and then configure the OpenShift application manually if you need <<control_application_config,more control over the deployment configuration>>.
ja_jp: <<control_application_config,デプロイ構成をより制御する>> 必要がある場合、ビルドとデプロイを1つのステップでトリガーすることも、 まずコンテナイメージをビルドしてからOpenShiftアプリケーションを手動で設定することもできます。

source: You can trigger a build and deployment in a single step or build the container image first and then configure the OpenShift application manually if you need xref:control_application_config[more control over the deployment configuration].
ja_jp: ビルドとデプロイメントを1つのステップでトリガーすることも、xref:control_application_config[デプロイメント設定をより制御] する必要がある場合にコンテナイメージを最初にビルドして、OpenShiftアプリケーションを手動で設定することもできます。

source: You can try calling the same URL again and again, it will always take six seconds to answer.
ja_jp: 何度同じURLを呼び出してみても、常に6秒で返事が返ってきます。

source: You can turn off sharing of the containers by specifying `quarkus.keycloak.devservices.shared=false`.
ja_jp: `quarkus.keycloak.devservices.shared=false` を指定すると、コンテナーの共有をオフにすることができます。

source: You can turn off this default behavior if you want to authenticate only when the target page requires it. To turn off proactive authentication so that authentication occurs only when the target page requires it, modify the `application.properties` configuration file as follows:
ja_jp: ターゲット・ページが要求したときにのみ認証を行いたい場合は、このデフォルトの動作をオフにすることができます。 プロアクティブ認証をオフにして、ターゲット・ページが要求したときにのみ認証を行なうようにするには、 `application.properties` の設定ファイルを以下のように変更します：

source: You can tweak the lifecycle either by not using the `quarkus` packaging or by configuring the default execution.
ja_jp: ライフサイクルは、 `quarkus` パッケージングを使用しないか、デフォルトの実行を設定することで調整できます。

source: You can update a screen automatically when a hot reload happens. To do this, replace the `LitElement` that your Webcomponent extends with `QwcHotReloadElement`.
ja_jp: ホットリロードの発生時に、画面を自動的に更新できます。そのためには、Webcomponent が拡張する `LitElement` を `QwcHotReloadElement` に置き換えます。

source: You can update or upgrade your {project-name} projects to the latest version of {project-name} by using an update command.
ja_jp: {project-name} プロジェクトを最新バージョンの {プロジェクト名} に更新またはアップグレードするには、updateコマンドを使用します。

source: You can update the Java code as you see fit. Once you've rebuilt, you can redeploy your function by executing the `update` command.
ja_jp: お好きなように Java コードを更新することができます。リビルドしたら、 `update` コマンドを実行することで、関数を再配備できます。

source: You can update the Java code as you see fit. Once you've rebuilt, you can redeploy your lambda by executing the `update` command.
ja_jp: お好きなように Java コードを更新することができます。リビルドしたら、 `update` コマンドを実行することで、Lambda を再配備できます。

source: You can update the `/swagger-ui` sub path by setting the `quarkus.swagger-ui.path` property in your `application.properties`:
ja_jp: `application.properties` の `quarkus.swagger-ui.path` プロパティーを設定することで、 `/swagger-ui` サブパスを更新することができます。

source: You can upgrade the Quarkus CLI with:
ja_jp: 以下の方法で、Quarkus CLI をアップグレードできます。

source: You can use @TestSecurity and @OidcSecurity annotations to test the `web-app` application endpoint code, which depends on either one of the following injections, or all four:
ja_jp: TestSecurityアノテーションと@OidcSecurityアノテーションを使用して、 `web-app` アプリケーションエンドポイントコードをテストすることができます。 `web-app` アプリケーションエンドポイントコードは、次の注入のいずれか、または4つすべてに依存します：

source: You can use Chocolatey to install (and update) the Quarkus CLI.
ja_jp: Chocolatey を使用して、Quarkus CLI をインストール (および更新) できます。

source: You can use Dev Services for Keycloak and the Dev UI for the OpenID Connect (OIDC) Keycloak provider and adapt these services for other OpenID Connect providers.
ja_jp: Keycloak用のDev ServicesとOpenID Connect（OIDC）Keycloakプロバイダー用のDev UIを使用し、これらのサービスを他のOpenID Connectプロバイダー用に適応させることができます。

source: You can use Dev Services for Keycloak and the Dev UI for the OpenID Connect (OIDC) Keycloak provider and adapt these services for other OpenID Connect providers. You can also use the Dev UI with OpenID Connect providers that have already been started before you run Quarkus in development mode.
ja_jp: Dev Services for Keycloak と OpenID Connect (OIDC) Keycloak プロバイダー用の Dev UI を使用して、これらのサービスを他の OpenID Connect プロバイダーに適応させることができます。 Quarkus を開発モードで実行する前に、すでに起動している OpenID Connect プロバイダーで Dev UI を使用することもできます。

source: You can use Homebrew to install (and update) the Quarkus CLI.
ja_jp: Homebrew を使用して、Quarkus CLI をインストール (および更新) できます。

source: You can use JAX-RS `ExceptionMapper` to capture Quarkus Security authentication exceptions such as `io.quarkus.security.AuthenticationFailedException`, for example:
ja_jp: JAX-RS `ExceptionMapper` を使用すると、例えば `io.quarkus.security.AuthenticationFailedException` のような Quarkus Security の認証例外を捕捉できます。例:

source: You can use Jakarta REST `ExceptionMapper` to capture Quarkus Security authentication exceptions such as `io.quarkus.security.AuthenticationFailedException`, for example:
ja_jp: Jakarta REST `ExceptionMapper` を使用して、例えば `io.quarkus.security.AuthenticationFailedException` のような Quarkus Security の認証例外を捕捉することができます:

source: You can use Jakarta REST `ExceptionMapper` to capture Quarkus Security authentication exceptions such as `io.quarkus.security.AuthenticationFailedException`. For example:
ja_jp: Jakarta REST `ExceptionMapper` を使用して、 `io.quarkus.security.AuthenticationFailedException` のような Quarkus Security 認証の例外をキャプチャできます。 例:

source: You can use OIDC authentication completion actions to perform the work that must be done only once upon a successful authorization code flow completion.
ja_jp: 認可コードフローの完了が成功したときに一度だけ実行する必要がある作業を行うために、OIDC 認証完了アクションを使用できます。

source: You can use OIDC filters to observe requests and responses to all OIDC endpoints.
ja_jp: OIDC フィルターを使用して、すべての OIDC エンドポイントへのリクエストとレスポンスを監視できます。

source: You can use OIDC redirect filters to observe redirect requests to both OIDC authorization and logout endpoints.
ja_jp: OIDC リダイレクトフィルターを使用して、OIDC の認可およびログアウトの両方のエンドポイントへのリダイレクト要求を監視できます。

source: You can use OIDC request filters to observe requests, add additional headers, customize a request body, and set context properties for coordinating with OIDC response filters.
ja_jp: OIDC リクエストフィルターを使用して、リクエストの監視、追加のヘッダーの追加、リクエストボディのカスタマイズ、および OIDC レスポンスフィルターと連携するためのコンテキストプロパティーの設定を行うことができます。

source: You can use OIDC response filters to observe responses, customize a response body, and use the context properties for coordinating with OIDC request filters.
ja_jp: OIDC レスポンスフィルターを使用して、レスポンスの監視、レスポンスボディのカスタマイズ、および OIDC リクエストフィルターと連携するためのコンテキストプロパティーの使用を行うことができます。

source: You can use Quarkus `quarkus-oidc-client-registration` extension to register one or more clients using OIDC client registration configurations and read, update and delete metadata of the registered clients.
ja_jp: Quarkus の `quarkus-oidc-client-registration` エクステンションを使用すると、OIDC クライアント登録設定を使用して 1 つ以上のクライアントを登録し、登録されたクライアントのメタデータを読み取り、更新、削除できます。

source: You can use Quarkus extensions for OpenID Connect and OAuth 2.0 access token management, focusing on acquiring, refreshing, and propagating tokens.
ja_jp: Quarkus エクステンションは、トークンの取得、更新、伝播を対象に、OpenID Connect および OAuth 2.0 アクセストークンの管理に使用できます。

source: You can use RSA public keys, Elliptic Curve (EC) public keys, and symmetric secret keys, to encrypt the claims.
ja_jp: クレームを暗号化するには、RSA 公開鍵、楕円曲線 (EC) 公開鍵、対称シークレットキーを使用できます。

source: You can use Redis as a cache using the `setex` command, which stores a given value to a given key for a given duration. The following snippet shows how such a command can be used to store `BusinessObject` for 1 second.
ja_jp: Redis をキャッシュとして使用するには、 `setex` コマンドを使用します。このコマンドは、指定したキーに指定した値を指定した期間だけ格納します。以下のスニペットは、このようなコマンドを使用して `BusinessObject` を 1 秒間格納する方法を示しています。

source: You can use SwaggerUI or GraphQL from OIDC DevUI for testing the service, instead of manually entering the service path to test. For example, if you add
ja_jp: テストするサービスパスを手動で入力する代わりに、OIDC DevUI の SwaggerUI または GraphQL を使用してサービスをテストできます。 たとえば以下をアプリケーションの pom に追加します。

source: You can use Twitter for OIDC login, but at the moment, it restricts access to the user's email, which means you will have to obtain it and verify it yourself.
ja_jp: OIDC ログインには Twitter を使用できますが、現時点では、ユーザーのメールへのアクセスが制限されているため、ご自身で Twitter を取得して確認する必要があります。

source: You can use X (formerly Twitter) for OIDC login, but at the moment, it restricts access to the user's email, which means you will have to obtain it and verify it yourself.
ja_jp: OIDC ログインには X (旧 Twitter) を使用できますが、現時点では、ユーザーのメールへのアクセスが制限されているため、 ご自身で Twitter を取得して確認する必要があります。

source: You can use `//Q:CONFIG <property>=<value>` to set up static configuration for your application.
ja_jp: `//Q:CONFIG <property>=<value>` を使用して、アプリケーションの静的設定を設定することができます。

source: You can use `@Find` methods to find single instances, or collections of entities, by using the parameters of the method to build a query. The Hibernate documentation has https://docs.jboss.org/hibernate/orm/7.1/introduction/html_single/Hibernate_Introduction.html#generated-finder-methods[all the information you need about this].
ja_jp: `@Find` メソッドを使用して、メソッドのパラメーターでクエリを構築することにより、単一のインスタンスまたはエンティティのコレクションを検索できます。Hibernate ドキュメントには、 https://docs.jboss.org/hibernate/orm/7.1/introduction/html_single/Hibernate_Introduction.html#generated-finder-methods[これに関する必要なすべての情報] があります。
